7767517
346 408
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
BinaryOp                 div_0                    1 1 in0 2 0=3 1=1 2=255.0
BinaryOp                 mul_1                    1 1 2 3 0=2 1=1 2=2.0
BinaryOp                 sub_2                    1 1 3 4 0=1 1=1 2=1.0
Split                    splitncnn_0              1 2 4 5 6
BinaryOp                 div_3                    1 1 in1 7 0=3 1=1 2=255.0
BinaryOp                 mul_4                    1 1 7 8 0=2 1=1 2=2.0
BinaryOp                 sub_5                    1 1 8 9 0=1 1=1 2=1.0
Convolution              convrelu_0               1 1 6 10 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=9408 9=1
Split                    splitncnn_1              1 2 10 11 12
Convolution              convrelu_1               1 1 12 13 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_2               1 1 13 14 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_6                    2 1 11 14 15 0=0
ReLU                     relu_123                 1 1 15 16
Split                    splitncnn_2              1 2 16 17 18
Convolution              convrelu_3               1 1 18 19 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              convrelu_4               1 1 19 20 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
BinaryOp                 add_7                    2 1 17 20 21 0=0
ReLU                     relu_126                 1 1 21 22
Split                    splitncnn_3              1 2 22 23 24
Convolution              convrelu_5               1 1 24 25 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=55296 9=1
Convolution              convrelu_6               1 1 25 26 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Convolution              conv_7                   1 1 23 27 0=96 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=6144
BinaryOp                 add_8                    2 1 27 26 28 0=0
ReLU                     relu_129                 1 1 28 29
Split                    splitncnn_4              1 2 29 30 31
Convolution              convrelu_7               1 1 31 32 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Convolution              convrelu_8               1 1 32 33 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
BinaryOp                 add_9                    2 1 30 33 34 0=0
ReLU                     relu_132                 1 1 34 35
Split                    splitncnn_5              1 2 35 36 37
Convolution              convrelu_9               1 1 37 38 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=110592 9=1
Convolution              convrelu_10              1 1 38 39 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_12                  1 1 36 40 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=12288
BinaryOp                 add_10                   2 1 40 39 41 0=0
ReLU                     relu_135                 1 1 41 42
Split                    splitncnn_6              1 2 42 43 44
Convolution              convrelu_11              1 1 44 45 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_12              1 1 45 46 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_11                   2 1 43 46 47 0=0
ReLU                     relu_138                 1 1 47 48
Split                    splitncnn_7              1 6 48 49 50 51 52 53 54
Convolution              convrelu_13              1 1 54 55 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_14              1 1 55 56 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_12                   2 1 49 56 57 0=0
ReLU                     relu_141                 1 1 57 58
Convolution              conv_17                  1 1 58 59 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              convrelu_15              1 1 53 60 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_16              1 1 60 61 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_13                   2 1 50 61 62 0=0
ReLU                     relu_144                 1 1 62 63
Convolution              convrelu_17              1 1 52 64 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Convolution              convrelu_18              1 1 64 65 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_23                  1 1 51 66 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=16384
BinaryOp                 add_14                   2 1 66 65 67 0=0
ReLU                     relu_147                 1 1 67 68
Split                    splitncnn_8              1 2 68 69 70
Convolution              convrelu_19              1 1 70 71 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_20              1 1 71 72 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_15                   2 1 69 72 73 0=0
ReLU                     relu_150                 1 1 73 74
Split                    splitncnn_9              1 6 74 75 76 77 78 79 80
Convolution              convrelu_21              1 1 80 81 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_22              1 1 81 82 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_16                   2 1 75 82 83 0=0
ReLU                     relu_153                 1 1 83 84
Convolution              conv_28                  1 1 84 85 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              convrelu_23              1 1 79 86 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_24              1 1 86 87 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_17                   2 1 76 87 88 0=0
ReLU                     relu_156                 1 1 88 89
Convolution              convrelu_25              1 1 78 90 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456 9=1
Convolution              convrelu_26              1 1 90 91 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_34                  1 1 77 92 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=16384
BinaryOp                 add_18                   2 1 92 91 93 0=0
ReLU                     relu_159                 1 1 93 94
Split                    splitncnn_10             1 2 94 95 96
Convolution              convrelu_27              1 1 96 97 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_28              1 1 97 98 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
BinaryOp                 add_19                   2 1 95 98 99 0=0
ReLU                     relu_162                 1 1 99 100
Split                    splitncnn_11             1 2 100 101 102
Convolution              conv_37                  1 1 102 103 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_39                  1 1 5 104 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=9408
InstanceNorm             in_90                    1 1 104 105 0=64 1=1.000000e-05 2=0
ReLU                     relu_163                 1 1 105 106
Split                    splitncnn_12             1 2 106 107 108
Convolution              conv_40                  1 1 108 109 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
InstanceNorm             in_91                    1 1 109 110 0=64 1=1.000000e-05 2=0
ReLU                     relu_164                 1 1 110 111
Convolution              conv_41                  1 1 111 112 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
InstanceNorm             in_92                    1 1 112 113 0=64 1=1.000000e-05 2=0
ReLU                     relu_165                 1 1 113 114
BinaryOp                 add_20                   2 1 107 114 115 0=0
ReLU                     relu_166                 1 1 115 116
Split                    splitncnn_13             1 2 116 117 118
Convolution              conv_42                  1 1 118 119 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
InstanceNorm             in_93                    1 1 119 120 0=64 1=1.000000e-05 2=0
ReLU                     relu_167                 1 1 120 121
Convolution              conv_43                  1 1 121 122 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
InstanceNorm             in_94                    1 1 122 123 0=64 1=1.000000e-05 2=0
ReLU                     relu_168                 1 1 123 124
BinaryOp                 add_21                   2 1 117 124 125 0=0
ReLU                     relu_169                 1 1 125 126
Split                    splitncnn_14             1 2 126 127 128
Convolution              conv_44                  1 1 128 129 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=55296
InstanceNorm             in_95                    1 1 129 130 0=96 1=1.000000e-05 2=0
ReLU                     relu_170                 1 1 130 131
Convolution              conv_45                  1 1 131 132 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
InstanceNorm             in_96                    1 1 132 133 0=96 1=1.000000e-05 2=0
ReLU                     relu_171                 1 1 133 134
Convolution              conv_46                  1 1 127 135 0=96 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=6144
InstanceNorm             in_97                    1 1 135 136 0=96 1=1.000000e-05 2=0
BinaryOp                 add_22                   2 1 136 134 137 0=0
ReLU                     relu_172                 1 1 137 138
Split                    splitncnn_15             1 2 138 139 140
Convolution              conv_47                  1 1 140 141 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
InstanceNorm             in_98                    1 1 141 142 0=96 1=1.000000e-05 2=0
ReLU                     relu_173                 1 1 142 143
Convolution              conv_48                  1 1 143 144 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
InstanceNorm             in_99                    1 1 144 145 0=96 1=1.000000e-05 2=0
ReLU                     relu_174                 1 1 145 146
BinaryOp                 add_23                   2 1 139 146 147 0=0
ReLU                     relu_175                 1 1 147 148
Split                    splitncnn_16             1 2 148 149 150
Convolution              conv_49                  1 1 150 151 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=110592
InstanceNorm             in_100                   1 1 151 152 0=128 1=1.000000e-05 2=0
ReLU                     relu_176                 1 1 152 153
Convolution              conv_50                  1 1 153 154 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
InstanceNorm             in_101                   1 1 154 155 0=128 1=1.000000e-05 2=0
ReLU                     relu_177                 1 1 155 156
Convolution              conv_51                  1 1 149 157 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=12288
InstanceNorm             in_102                   1 1 157 158 0=128 1=1.000000e-05 2=0
BinaryOp                 add_24                   2 1 158 156 159 0=0
ReLU                     relu_178                 1 1 159 160
Split                    splitncnn_17             1 2 160 161 162
Convolution              conv_52                  1 1 162 163 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
InstanceNorm             in_103                   1 1 163 164 0=128 1=1.000000e-05 2=0
ReLU                     relu_179                 1 1 164 165
Convolution              conv_53                  1 1 165 166 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
InstanceNorm             in_104                   1 1 166 167 0=128 1=1.000000e-05 2=0
ReLU                     relu_180                 1 1 167 168
BinaryOp                 add_25                   2 1 161 168 169 0=0
ReLU                     relu_181                 1 1 169 170
Convolution              conv_54                  1 1 170 171 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_55                  1 1 9 172 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=9408
InstanceNorm             in_105                   1 1 172 173 0=64 1=1.000000e-05 2=0
ReLU                     relu_182                 1 1 173 174
Split                    splitncnn_18             1 2 174 175 176
Convolution              conv_56                  1 1 176 177 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
InstanceNorm             in_106                   1 1 177 178 0=64 1=1.000000e-05 2=0
ReLU                     relu_183                 1 1 178 179
Convolution              conv_57                  1 1 179 180 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
InstanceNorm             in_107                   1 1 180 181 0=64 1=1.000000e-05 2=0
ReLU                     relu_184                 1 1 181 182
BinaryOp                 add_26                   2 1 175 182 183 0=0
ReLU                     relu_185                 1 1 183 184
Split                    splitncnn_19             1 2 184 185 186
Convolution              conv_58                  1 1 186 187 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
InstanceNorm             in_108                   1 1 187 188 0=64 1=1.000000e-05 2=0
ReLU                     relu_186                 1 1 188 189
Convolution              conv_59                  1 1 189 190 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
InstanceNorm             in_109                   1 1 190 191 0=64 1=1.000000e-05 2=0
ReLU                     relu_187                 1 1 191 192
BinaryOp                 add_27                   2 1 185 192 193 0=0
ReLU                     relu_188                 1 1 193 194
Split                    splitncnn_20             1 2 194 195 196
Convolution              conv_60                  1 1 196 197 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=55296
InstanceNorm             in_110                   1 1 197 198 0=96 1=1.000000e-05 2=0
ReLU                     relu_189                 1 1 198 199
Convolution              conv_61                  1 1 199 200 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
InstanceNorm             in_111                   1 1 200 201 0=96 1=1.000000e-05 2=0
ReLU                     relu_190                 1 1 201 202
Convolution              conv_62                  1 1 195 203 0=96 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=6144
InstanceNorm             in_112                   1 1 203 204 0=96 1=1.000000e-05 2=0
BinaryOp                 add_28                   2 1 204 202 205 0=0
ReLU                     relu_191                 1 1 205 206
Split                    splitncnn_21             1 2 206 207 208
Convolution              conv_63                  1 1 208 209 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
InstanceNorm             in_113                   1 1 209 210 0=96 1=1.000000e-05 2=0
ReLU                     relu_192                 1 1 210 211
Convolution              conv_64                  1 1 211 212 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
InstanceNorm             in_114                   1 1 212 213 0=96 1=1.000000e-05 2=0
ReLU                     relu_193                 1 1 213 214
BinaryOp                 add_29                   2 1 207 214 215 0=0
ReLU                     relu_194                 1 1 215 216
Split                    splitncnn_22             1 2 216 217 218
Convolution              conv_65                  1 1 218 219 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=110592
InstanceNorm             in_115                   1 1 219 220 0=128 1=1.000000e-05 2=0
ReLU                     relu_195                 1 1 220 221
Convolution              conv_66                  1 1 221 222 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
InstanceNorm             in_116                   1 1 222 223 0=128 1=1.000000e-05 2=0
ReLU                     relu_196                 1 1 223 224
Convolution              conv_67                  1 1 217 225 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=12288
InstanceNorm             in_117                   1 1 225 226 0=128 1=1.000000e-05 2=0
BinaryOp                 add_30                   2 1 226 224 227 0=0
ReLU                     relu_197                 1 1 227 228
Split                    splitncnn_23             1 2 228 229 230
Convolution              conv_68                  1 1 230 231 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
InstanceNorm             in_118                   1 1 231 232 0=128 1=1.000000e-05 2=0
ReLU                     relu_198                 1 1 232 233
Convolution              conv_69                  1 1 233 234 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
InstanceNorm             in_119                   1 1 234 235 0=128 1=1.000000e-05 2=0
ReLU                     relu_199                 1 1 235 236
BinaryOp                 add_31                   2 1 229 236 237 0=0
ReLU                     relu_200                 1 1 237 238
Convolution              conv_70                  1 1 238 239 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
TanH                     tanh_226                 1 1 59 240
Split                    splitncnn_24             1 4 240 241 242 243 244
TanH                     tanh_227                 1 1 85 245
Split                    splitncnn_25             1 4 245 246 247 248 249
TanH                     tanh_228                 1 1 103 250
Split                    splitncnn_26             1 3 250 251 252 253
Convolution              convrelu_29              1 1 63 254 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_30              1 1 89 255 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              convrelu_31              1 1 101 256 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_71                  1 1 254 257 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
Slice                    split_0                  1 3 257 258 259 260 -23300=3,128,128,-233 1=0
Convolution              conv_72                  1 1 255 261 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
Slice                    split_1                  1 3 261 262 263 264 -23300=3,128,128,-233 1=0
Convolution              conv_73                  1 1 256 265 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
Slice                    split_2                  1 3 265 266 267 268 -23300=3,128,128,-233 1=0
Einsum                   einsum_0                 2 1 171 239 269 -23300=12,108,105,106,44,108,105,107,45,62,105,106,107
Reshape                  reshape_239              1 1 269 270 0=128 1=1 11=128 2=96
BinaryOp                 div_32                   1 1 270 271 0=3 1=1 2=16.0
Reshape                  reshape_240              1 1 271 272 0=128 1=1 11=1 2=12288
Split                    splitncnn_27             1 2 272 273 274
Pooling                  avgpool2d_203            1 1 273 275 0=1 1=2 11=1 12=1 13=0 2=2 3=0 5=1 6=1
Split                    splitncnn_28             1 2 275 276 277
Pooling                  avgpool2d_204            1 1 276 278 0=1 1=2 11=1 12=1 13=0 2=2 3=0 5=1 6=1
Split                    splitncnn_29             1 2 278 279 280
Pooling                  avgpool2d_205            1 1 279 281 0=1 1=2 11=1 12=1 13=0 2=2 3=0 5=1 6=1
MemoryData               pnnx_fold_coords0.1      0 1 282 0=128 1=96 11=2 2=1
Split                    splitncnn_0              1 2 282 283 284
Split                    splitncnn_30             1 2 284 285 286
MemoryData               pnnx_fold_grid.1         0 1 287 0=2 1=9 11=1 2=12288
GridSample               gridsample_208           2 1 274 287 288 0=1 1=1 2=1 3=0
Reshape                  reshape_241              1 1 288 289 0=9 1=128 2=96
MemoryData               pnnx_fold_grid0.1        0 1 290 0=2 1=9 11=1 2=12288
GridSample               gridsample_209           2 1 277 290 291 0=1 1=1 2=1 3=0
Reshape                  reshape_242              1 1 291 292 0=9 1=128 2=96
MemoryData               pnnx_fold_grid1.1        0 1 293 0=2 1=9 11=1 2=12288
GridSample               gridsample_210           2 1 280 293 294 0=1 1=1 2=1 3=0
Reshape                  reshape_243              1 1 294 295 0=9 1=128 2=96
MemoryData               pnnx_fold_grid2.1        0 1 296 0=2 1=9 11=1 2=12288
GridSample               gridsample_211           2 1 281 296 297 0=1 1=1 2=1 3=0
Reshape                  reshape_244              1 1 297 298 0=9 1=128 2=96
Concat                   cat_0                    4 1 289 292 295 298 299 0=2
Permute                  permute_235              1 1 299 300 0=4
MemoryData               pnnx_fold_input5.3       0 1 301 0=128 1=96 2=2
Pooling                  avgpool2d_206            1 1 249 302 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
Split                    splitncnn_31             1 2 302 303 304
Concat                   cat_1                    2 1 251 303 305 0=0
Split                    splitncnn_32             1 2 305 306 307
Convolution              conv_74                  1 1 307 308 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
BinaryOp                 add_33                   2 1 308 266 309 0=0
Sigmoid                  sigmoid_219              1 1 309 310
Split                    splitncnn_33             1 2 310 311 312
Convolution              conv_75                  1 1 306 313 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
BinaryOp                 add_34                   2 1 313 267 314 0=0
Sigmoid                  sigmoid_220              1 1 314 315
BinaryOp                 mul_35                   2 1 315 252 316 0=2
Concat                   cat_2                    2 1 316 304 317 0=0
Convolution              conv_76                  1 1 317 318 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
BinaryOp                 add_36                   2 1 318 268 319 0=0
TanH                     tanh_229                 1 1 319 320
BinaryOp                 mul_37                   2 1 311 320 321 0=2
BinaryOp                 sub_38                   1 1 312 322 0=7 1=1 2=1.0
BinaryOp                 mul_39                   2 1 322 253 323 0=2
BinaryOp                 add_40                   2 1 323 321 324 0=0
Pooling                  avgpool2d_207            1 1 244 325 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
Interp                   upsample_233             1 1 324 326 0=2 3=48 4=64 6=1
Concat                   cat_3                    2 1 325 326 327 0=0
Split                    splitncnn_34             1 2 327 328 329
Concat                   cat_4                    2 1 246 328 330 0=0
Split                    splitncnn_35             1 2 330 331 332
Convolution              conv_77                  1 1 332 333 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
BinaryOp                 add_41                   2 1 333 262 334 0=0
Sigmoid                  sigmoid_221              1 1 334 335
Split                    splitncnn_36             1 2 335 336 337
Convolution              conv_78                  1 1 331 338 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
BinaryOp                 add_42                   2 1 338 263 339 0=0
Sigmoid                  sigmoid_222              1 1 339 340
BinaryOp                 mul_43                   2 1 340 247 341 0=2
Concat                   cat_5                    2 1 341 329 342 0=0
Convolution              conv_79                  1 1 342 343 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
BinaryOp                 add_44                   2 1 343 264 344 0=0
TanH                     tanh_230                 1 1 344 345
BinaryOp                 mul_45                   2 1 336 345 346 0=2
BinaryOp                 sub_46                   1 1 337 347 0=7 1=1 2=1.0
BinaryOp                 mul_47                   2 1 347 248 348 0=2
BinaryOp                 add_48                   2 1 348 346 349 0=0
Convolution              convrelu_32              1 1 300 350 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              convrelu_33              1 1 350 351 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
MemoryData               pnnx_fold_flo.1          0 1 352 0=128 1=96 2=64
Concat                   cat_6                    2 1 351 352 353 0=0
Convolution              convrelu_34              1 1 353 354 0=126 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=145152 9=1
Concat                   cat_7                    2 1 354 301 355 0=0
Interp                   upsample_234             1 1 349 356 0=2 3=96 4=128 6=1
Concat                   cat_8                    2 1 355 356 357 0=0
Split                    splitncnn_37             1 2 357 358 359
Concat                   cat_9                    2 1 241 358 360 0=0
Split                    splitncnn_38             1 2 360 361 362
Convolution              conv_83                  1 1 362 363 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
BinaryOp                 add_49                   2 1 363 258 364 0=0
Sigmoid                  sigmoid_223              1 1 364 365
Split                    splitncnn_39             1 2 365 366 367
Convolution              conv_84                  1 1 361 368 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
BinaryOp                 add_50                   2 1 368 259 369 0=0
Sigmoid                  sigmoid_224              1 1 369 370
BinaryOp                 mul_51                   2 1 370 242 371 0=2
Concat                   cat_10                   2 1 371 359 372 0=0
Convolution              conv_85                  1 1 372 373 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=442368
BinaryOp                 add_52                   2 1 373 260 374 0=0
TanH                     tanh_231                 1 1 374 375
BinaryOp                 mul_53                   2 1 366 375 376 0=2
BinaryOp                 sub_54                   1 1 367 377 0=7 1=1 2=1.0
BinaryOp                 mul_55                   2 1 377 243 378 0=2
BinaryOp                 add_56                   2 1 378 376 379 0=0
Split                    splitncnn_40             1 2 379 380 381
Convolution              convrelu_35              1 1 381 382 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              conv_87                  1 1 382 383 0=2 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Convolution              convrelu_36              1 1 380 384 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              conv_89                  1 1 384 385 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
BinaryOp                 mul_57                   1 1 385 386 0=2 1=1 2=0.25
Slice                    tensor_split_0           1 2 383 387 388 -23300=2,1,-233 1=0
BinaryOp                 mul_58                   1 1 388 389 0=2 1=1 2=0.0
Concat                   cat_11                   2 1 387 389 390 0=0
BinaryOp                 add_59                   2 1 285 390 391 0=0
BinaryOp                 sub_60                   2 1 391 286 392 0=1
Reshape                  reshape_245              1 1 386 393 0=12288 1=16 2=9
Softmax                  softmax_225              1 1 393 394 0=0 1=1
BinaryOp                 mul_61                   1 1 392 395 0=2 1=1 2=4.0
Unfold                   unfold_232               1 1 395 396 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1
Reshape                  reshape_246              1 1 396 397 0=12288 1=9 2=2
Permute                  permute_236              1 1 397 398 0=4
Reshape                  reshape_247              1 1 398 399 0=9 1=2 2=12288
Permute                  permute_237              1 1 394 400 0=4
Reshape                  reshape_248              1 1 400 401 0=16 1=9 2=12288
MatMul                   matmul_251               2 1 399 401 402
Reshape                  reshape_249              1 1 402 403 0=32 1=12288
Permute                  permute_238              1 1 403 404 0=1
Reshape                  reshape_250              1 1 404 405 0=128 1=96 2=32
PixelShuffle             pixel_shuffle_212        1 1 405 406 0=4 1=0
Crop                     slice_0                  1 1 406 out0 -23310=1,1 -23311=1,0 -23309=1,0
